## 2.2 处理重复数据

推荐阅读：

- 《跟老齐学Python：数据分析》
- 《Python大学实用教程》

In [1]:
import pandas as pd
d = {'Name':['Newton', 'Galilei', 'Einstein', 'Feynman', 'Newton', 'Maxwell', 'Galilei'],
             'Age':[26, 30, 28, 28, 26, 39, 40],
             'Score':[90, 80, 90, 100, 90, 70, 90]}
df = pd.DataFrame(d,columns=['Name','Age','Score'])
df

       Name  Age  Score
0    Newton   26     90
1   Galilei   30     80
2  Einstein   28     90
3   Feynman   28    100
4    Newton   26     90
5   Maxwell   39     70
6   Galilei   40     90

**基础知识**

In [2]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [3]:
df.duplicated?

In [4]:
df.duplicated('Age', keep='last')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
dtype: bool

In [5]:
df.duplicated(['Age', 'Score'])

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [6]:
df.drop_duplicates()

       Name  Age  Score
0    Newton   26     90
1   Galilei   30     80
2  Einstein   28     90
3   Feynman   28    100
5   Maxwell   39     70
6   Galilei   40     90

In [7]:
df.drop_duplicates('Age', keep='last')

      Name  Age  Score
1  Galilei   30     80
3  Feynman   28    100
4   Newton   26     90
5  Maxwell   39     70
6  Galilei   40     90

**项目案例**

In [8]:
df[df.duplicated()].count() / df.count()

Name     0.142857
Age      0.142857
Score    0.142857
dtype: float64

In [9]:
df.duplicated().any()

True

**动手练习**

In [13]:
path = "/Users/qiwsir/Documents/Codes/DataSet"
cpi = pd.read_excel(path + "/cpi/cpi.xls")
cpi.columns = cpi.iloc[1]    
cpi = cpi[2:]    
cpi.drop([11, 12], axis=0, inplace=True)    
cpi['cpi_index'] = ['总体消费', '食品烟酒', '衣着', '居住', '生活服务', '交通通信', '教育娱乐', '医保', '其他']
cpi.drop(['指标'], axis=1, inplace=True)    
cpi.reset_index(drop=True, inplace=True)    
cpi.columns.rename('', inplace=True)    
cpi

,2019年3月,2019年2月,2019年1月,2018年12月,2018年11月,2018年10月,2018年9月,2018年8月,2018年7月,2018年6月,2018年5月,2018年4月,cpi_index
0,102.3,101.5,101.7,101.9,102.2,102.5,102.5,102.3,102.1,101.9,101.8,101.8,总体消费
1,103.5,101.2,102,102.4,102.5,102.9,103,101.9,101,100.8,100.7,101.1,食品烟酒
2,102,102,101.6,101.5,101.4,101.4,101.2,101.3,101.2,101.1,101.1,101.1,衣着
3,102.1,102.2,102.1,102.2,102.4,102.5,102.6,102.5,102.4,102.3,102.2,102.2,居住
4,101.2,101.3,101.5,101.4,101.5,101.5,101.6,101.6,101.6,101.5,101.5,101.5,生活服务
5,100.1,98.8,98.7,99.3,101.6,103.2,102.8,102.7,103,102.4,101.8,101.1,交通通信
6,102.4,102.4,102.9,102.3,102.5,102.5,102.2,102.6,102.3,101.8,101.9,102,教育娱乐
7,102.7,102.8,102.7,102.5,102.6,102.6,102.7,104.3,104.6,105,105.1,105.2,医保
8,101.9,102,102.3,101.6,101.5,101.3,100.7,101.2,101.2,100.9,101,100.9,其他

In [43]:
dup_ratio = []
for column in cpi.columns:
    col = cpi[column]
    ratio = col[col.duplicated()].count() / col.count()
    dup_ratio.append(round(ratio, 2))
dup_ratio

[0.0, 0.11, 0.0, 0.0, 0.22, 0.22, 0.0, 0.0, 0.11, 0.0, 0.11, 0.22, 0.0]

In [44]:
dr = pd.Series(dup_ratio, index=cpi.columns)
dr

2019年3月      0.00
2019年2月      0.11
2019年1月      0.00
2018年12月     0.00
2018年11月     0.22
2018年10月     0.22
2018年9月      0.00
2018年8月      0.00
2018年7月      0.11
2018年6月      0.00
2018年5月      0.11
2018年4月      0.22
cpi_index    0.00
dtype: float64